Repository: ropensci/datefixR
Catalog: po/R-*.po
Languages: de, id, ru

source: df should be a dataframe object!
de: df muss ein dataframe Objekt sein!
id: df harus tipe objek dataframe!
ru: `df` должен быть объектом класса `dataframe`!

source: col.names should be a character vector!
de: col.names muss ein character vector sein!
id: col.names harus berupa character vector!
ru: `col.names` должен быть строковым вектором (т.е. класса 'character')

source: Unable to resolve date for subject
de: Datum kann nicht aufgelöst werden für
id: Tidak dapat menuntaskan tanggal untuk subjek
ru: Не удалось определить дату для предмета

source: (date:
de: (Datum:
id: (tanggal:
ru: (дата:

source: unable to tidy a date
de: Datum kann nicht bereinigt werden
id: tanggal tidak dapat dirapihkan
ru: Не удалось почистить дату

source: month.impute should be an integer between 1 and 12
de: month.impute sollte eine Ganzzahl zwischen 1 und 12 sein
id: month.impute harus berupa bilangan bulat antara 1 dan 12
ru: `month.impute` должен быть целым числом (класса 'integer') от 1 до 12

source: month.impute should be an integer
de: month.impute sollte eine Ganzzahl sein
id: month.impute harus berupa bilangan bulat
ru: `month.impute` должен быть целым числом (класса 'integer')

source: Month not in expected range
de: Monat nicht im erwarteten Bereich
id: Bulan bukan dalam jangka yang di ekspektasi
ru: Месяц определен вне ожидаемого диапазона

source: Day not in expected range
de: Tag nicht im erwarteten Bereich
id: Hari bukan dalam jangka yang di ekspektasi

source: format should be either 'dmy' or 'mdy'
de: format sollte entweder 'dmy' oder 'mdy' sein
id: format harus 'dmy' atau 'mdy'
ru: переменная `format` должна быть либо 'dmy' (т.е., день-месяц-год), либо 'mdy' (т.е., месяц-день-год)

source: NA imputed (date:
de: NA imputiert (Datum:
id: NA diperhitungkan (tanggal:
ru: Н/Д (т.е. `NA`) присвоено (дата:

source: NA imputed for subject
de: NA imputiert für
id: NA diperhitungkan untuk subjek
ru: Н/Д (т.е. `NA`) присвоено для предмета

source: date should be a character
de: date muss vom Typ character sein
id: tanggal harus berupa karakter
ru: Переменная `date` должна быть строкой

source: theme should be 'datefixR' or 'none'
de: theme muss 'datefixR' oder 'none' sein
id: tema harus berupa 'datefixR' atau 'none'
ru: Переменная `theme` должна быть 'datefixR' или 'none'

source: The current locale does not support multibyte characters.
de: Das aktuelle Gebietsschema unterstützt keine Multibyte-Zeichen.
id: Locale ini tidak mendukung karakter multibyte.
ru: Текущая локаль не поддерживает многобайтовые символы.

source: You may run into difficulties if any months are given as
de: Sie können auf Schwierigkeiten stoßen, wenn Monate angegeben sind als
id: Anda mungkin mengalami kesulitan jika ada bulan yang diberikan sebagai
ru: Вы можете столкнуться с трудностями, если какие-либо месяцы указаны как

source: non-English language names.
de: nicht englischsprachige Namen.
id: nama-nama bahasa bukan dalam Bahasa Inggris.
ru: названия не на английском языке.

source: Day of the year not in expected range
ru: День года определен вне ожидаемого диапазона
